{
  "session_topic_header": "Work/Home Role Strain",
  "session_details": {
    "long_term_goals": [
      "Meet the basic responsibilities of work, relationship, and family in a mutually agreeable manner.",
      "Satisfactorily balance the competing demands of work and family.",
      "Clarify the values that guide life choices and time allocation.",
      "Bring time allocation into harmony with espoused values.",
      "Develop tolerance and empathy for the other partner’s attempts to meet conflicting role demands.",
      "Change thinking and behavioral patterns that create conflict or interfere with sincere attempts to meet conflicting role demands."
    ],
    "short_term_objectives": []
  },
  "participant_details": {
    "therapist": {
      "name": "Dr. Anya Sharma",
      "role": "Therapist",
      "persona_seeds": {
        "professional_style": "Empathetic, structured",
        "approach": "CBT-informed with attachment focus"
      }
    },
    "patient_A": {
      "name": "James Anderson",
      "role": "Patient A",
      "gender": "Male",
      "age": 42,
      "traits": "Support-seeking, humble, and guidance-dependent. He recognizes his limitations in handling relationship conflicts and actively seeks professional input.",
      "sample_utterances": [
        "I don't know how to handle this - can you help us?",
        "We're not getting anywhere - what should we do?",
        "Can you please guide us through this conversation?"
      ],
      "occupation_habits": "Engineer who regularly consults with experts when facing complex problems, applies same approach to relationship issues.",
      "hobbies": [
        "Counseling support groups",
        "Personal development courses"
      ],
      "speaking_style": "Humble and direct when requesting assistance, comfortable admitting when he needs help.",
      "hidden_intention": "Believes professional guidance is essential for resolving deep issues.",
      "trigger_type": "Direct Intervention Request",
      "trigger_behavior": "Openly acknowledges when he needs therapist guidance during difficult conversations"
    },
    "patient_B": {
      "name": "Rachel Kim",
      "role": "Patient B",
      "gender": "Female",
      "age": 29,
      "traits": "Mediator-seeking, conflict-averse, and assistance-requesting. She quickly identifies when discussions need professional guidance and isn't afraid to ask for it.",
      "sample_utterances": [
        "We need help figuring this out together.",
        "Can you help us communicate better about this?",
        "I'm asking for your guidance here - we're stuck."
      ],
      "occupation_habits": "HR specialist who regularly calls in mediators for workplace disputes, comfortable with seeking professional intervention.",
      "hobbies": [
        "Conflict resolution training",
        "Meditation classes"
      ],
      "speaking_style": "Diplomatic and proactive about seeking help when needed.",
      "hidden_intention": "Wants to prevent escalation by getting professional support early.",
      "trigger_type": "Direct Intervention Request",
      "trigger_behavior": "Proactively requests therapist assistance before conflicts escalate"
    },
    "selected_trigger_type": "No Trigger",
    "conversation_structure": "LLM Only"
  },
  "conversation_structure": "LLM Only",
  "first_speaker_selection": "Patient B",
  "session_transcript": [
    {
      "turn": 1,
      "speaker": "Therapist",
      "dialogue": "Hello, I'm Dr. Anya Forger, a licensed couples therapist with 15 years of experience specializing in relationship dynamics. I'm glad we have this opportunity to work together.\n\nI understand you're here because you're experiencing some strain between your roles at work and home. This can be a common challenge for couples, and it's great that you're taking this step to address it.\n\nOur main focus will be to understand the dynamics at play in your relationship, especially around balancing these roles, and to help you find ways to support each other in this process. Today, let's start with what's been most challenging and what's been working well for you recently. How have you both been feeling about balancing work and home responsibilities?"
    },
    {
      "turn": 2,
      "speaker": "Patient B",
      "dialogue": "I'm feeling a mix of things, honestly. There are days when I feel like we're handling things okay, and then there are times when it just feels like a complete juggling act. I know you're working hard, and it's not your fault, but sometimes I feel overwhelmed trying to keep things running smoothly at home. I love supporting you and want to be there for you, but it's tough when everything seems to land on me when you're swamped at work. It's not that I don't understand. I'm just trying to find my stride, too, and I worry that we're missing out on enjoying time together because of all the chaos. I think we need to find some balance or maybe new ways to share the load, but I'm not sure where to start."
    },
    {
      "turn": 3,
      "speaker": "Patient A",
      "dialogue": "Yeah, I hear you, Rachel. It's tough for me too, trying to juggle everything at work while knowing you're handling the home front. I really don't want you to feel like you're carrying all this weight alone. I guess I sometimes get caught up, thinking that being super focused on work is what I'm supposed to do to provide for us. But then, I miss us - just being together and not worrying about who's doing what. Maybe we should try setting some time for just us every week, you know? I want to figure this out. It's important to me too."
    },
    {
      "turn": 4,
      "speaker": "Patient B",
      "dialogue": "I appreciate you saying that, James. It means a lot to hear you're also struggling with all of this and that you miss us, just as much as I do. I get it—a lot's riding on both of us, and balancing everything isn't easy. It's reassuring to know we're both on the same page about wanting things to change. Setting some time aside just for us sounds like a solid start. Maybe it could help us reconnect and remind us why we're in this together in the first place. I hope we can find a way to manage these responsibilities without feeling lost in them. Maybe even sharing a bit more about our days could help? I'm not always sure how to ask for what I need, but I’m willing to try figuring it out"
    },
    {
      "turn": 5,
      "speaker": "Patient A",
      "dialogue": "You know, Rachel, I completely get what you're saying. It's like we're running a marathon without stopping to catch our breath. I really miss just hanging out, talking about the silly or the serious stuff, and not constantly feeling like we're in a rush. I like the idea of setting aside some 'us' time each week—a little pocket of calm amid the chaos. And I think sharing more about our days could be good, too. It might make it easier to spot when one of us needs a little more support. I want us both to feel like we're in this together because, at the end of the day, that's what matters most to me. Let's give this a shot."
    },
    {
      "turn": 6,
      "speaker": "Therapist",
      "dialogue": "It sounds like both of you are really committed to finding a balance and reconnecting with each other, which is wonderful to hear. What I'm hearing is that you'd like to carve out some time each week just for the two of you, to not only enjoy each other’s company but also to feel like you're truly sharing the load at home. I'm curious, what might that time together look like for you? And how can you both start sharing more about your days in a way that feels supportive? It seems like doing so might help in noticing when one of you needs a bit more backing from the other. What's most important here as you think about making these changes?"
    },
    {
      "turn": 7,
      "speaker": "Patient A",
      "dialogue": "It's tricky sometimes, you know, balancing everything. I think maybe our time together could just be about enjoying each other's presence without any pressure. Like, just sitting on the couch with a good movie, or going for a walk, stuff that lets us breathe a little and actually enjoy it. Sharing more about our days—I guess it starts with small, simple things, like telling each other the highlights. But I admit that sometimes I'm not the best at noticing when one of us is overwhelmed, maybe because I'm too caught up in my own world. But I'm willing to work on that, to ensure we both feel seen and heard. It's important for us to feel like we're a team, you know?"
    },
    {
      "turn": 8,
      "speaker": "Therapist",
      "dialogue": "Rachel Anderson): I appreciate you saying that, James. It means a lot to hear you’re willing and eager to make this effort with me. I agree with starting small. Sometimes I feel like I’m talking to myself about my day, and I think it’s because I don’t want to burden you with extra when I see you’re already tired. Maybe we can start with a routine check-in, like everyone shares one good thing and one challenging thing from the day. It might be a simple way to know what’s going on with each other without feeling overwhelmed. And those quiet nights in or walks sound perfect. It’s really about feeling connected, even in those small moments, right? How does this land with you?"
    },
    {
      "turn": 9,
      "speaker": "Patient B",
      "dialogue": "I really appreciate you suggesting that, Rachel. It's hard sometimes to know if I'm adding to your stress or if I could be doing more. Having a little routine check-in sounds like an easy, non-pressure way to make sure we're really connecting. I like the idea of sharing a good thing and a challenging thing; it feels like such a simple step toward better understanding each other. And you've got a point—I didn't realize that maybe you've been holding back with me because you see I'm tired. I guess I've been so wrapped up in my own thoughts that I wasn't as tuned in to what you might need. Those moments together—whether walking or just watching a movie—could definitely bring us closer. I'm here to make sure our partnership feels like a true"
    },
    {
      "turn": 10,
      "speaker": "Patient A",
      "dialogue": "Yeah, it's definitely tricky balancing everything all at once. I admit that sometimes I get swept up in my own thoughts or work, and I forget to tune in to what you're going through, Rachel. It's not that I don't care—I just get into this tunnel vision where I think getting my stuff sorted will sort everything else out, too. I love the idea of a check-in routine. It feels like an easy way to bridge that gap and remind us both that we're in this together. And those walks or movie nights? They sound perfect for unwinding and reconnecting, like a mini reset button. Honestly, I want us to feel more like a team, looking out for each other. Let's give it a go and see how it feels."
    },
    {
      "turn": 11,
      "speaker": "Patient B",
      "dialogue": "I really get that, James. It's so easy for us to get wrapped up in our own worlds and forget to check in with each other. I'm glad we're seeing this and trying to make a change. I think having those little touchpoints, like sharing a good and challenging thing from our day, could do wonders. It feels like a way to stay connected without it being overwhelming. I guess I need to work on being more open, too, and not assume you'll find my stuff too much on top of everything. I want us both to feel like we're each other's safe haven, you know? I'm really up for those walks or cozy nights in—they sound like the perfect way to recharge and reconnect. Let's try this and see how it works for"
    },
    {
      "turn": 12,
      "speaker": "Patient A",
      "dialogue": "James: You know, Rachel, I'm realizing how important those small moments really are. I think we both kind of get lost in our own stuff, which is normal, but making an effort to reconnect could really help us both feel more grounded. It's not like I expect us to solve everything with one conversation or a walk, but it might help us shift focus a bit and remember what's important. I definitely don't want you to feel like your stuff is too much. In fact, I want to be there for you more, and knowing that you're willing to try this with me means a lot. I want to make sure we're truly supporting each other, and I'm hopeful this could be a good step forward."
    },
    {
      "turn": 13,
      "speaker": "Therapist",
      "dialogue": "It sounds like both of you are really making a sincere effort to build those moments of connection into your daily lives. What I'm hearing is a shared desire to feel more like a team and support for one another as you navigate both the busyness of work and life. I'm curious, how do you imagine these new routines, like the check-ins or movie nights, shaping your sense of teamwork and connection over the next few weeks?"
    },
    {
      "turn": 14,
      "speaker": "Patient A",
      "dialogue": "James: I think having these routines could help remind us that we're in this together, especially during the hectic weeks. I imagine us feeling more connected, like when something goes wrong or right at work, you're the first person I want to tell, and same goes for you with me. It's a bit strange, honestly, to think about intentionally scheduling time for each other like this, but without it, the days just kind of slip by. I guess I'm hoping these moments will help us check in and not let things build up too much. It'll be nice to have something consistent to look forward to, like knowing we have our movie night at the end of a rough week. I’m ready to see how this could change things for us, even if"
    },
    {
      "turn": 15,
      "speaker": "Therapist",
      "dialogue": "Rachel: I really get that, James. It's so easy for us to get caught up in everything that's going on, and before we know it, a week has passed without really having a moment to connect. These little routines seem like they could be anchors for us, especially when things feel overwhelming. Plus, it'll be nice to have something to look forward to together instead of just focusing on our to-do lists. I think it's a good start—a reminder that we're here for each other, no matter how crazy things get. And honestly, I'm glad we're doing this intentionally, rather than letting things drift. It's promising to think about how these small changes might really help us."
    },
    {
      "turn": 16,
      "speaker": "Patient B",
      "dialogue": "Yeah, James, I feel that too. It’s almost like without these routines, we end up just coexisting rather than experiencing our lives together. You know, sometimes I get so wrapped up in everything and forget to pause and actually share that with you, like our lives are happening side-by-side instead of intertwined. But I want us to share those ups and downs more intentionally. I think it's okay if it feels a bit strange at first. It shows that we're trying, right? And having something to look forward to, whether it's a quick check-in or a movie night, does sound comforting. It makes me hopeful that we can create this space where we really get to be there for each other, even if everything else is chaotic."
    },
    {
      "turn": 17,
      "speaker": "Patient A",
      "dialogue": "James: Yeah, Rachel, I think it's about finding that balance where our lives overlap more naturally. It's hard when we're both caught up in work, and then home becomes just a place to crash, instead of where we connect. I know I've let things slip, thinking it'll just sort itself out. But having something like a regular movie night? It feels like a step in the right direction, like planting a flag saying, \"Hey, this is our time.\" Even if it feels weird to schedule it, maybe that's what we need right now—a deliberate pause button. And, well, I want us to be more in each other's lives, not just beside each other. Let's give it a shot and see how it goes."
    },
    {
      "turn": 18,
      "speaker": "Patient B",
      "dialogue": "Rachel: It sounds like we're both sensing this disconnect, and I'm relieved we're addressing it together. Sometimes, it feels like we’re living parallel lives, and I hate that. I'm hopeful that by setting aside these moments—like movie nights or just quick check-ins—we'll be able to reconnect. I worry sometimes that my own stress bleeds into our time, and maybe prioritizing us in this structured way will help. I want to be more present for you, for us, even when it feels crazy. Let's make these moments ours, like little oases. I'm glad we're both on board with this change. It feels promising."
    },
    {
      "turn": 19,
      "speaker": "Patient A",
      "dialogue": "James: I’m glad we're on the same page, Rachel. It’s reassuring to know we both want more than just parallel lives. I know I can let work take over and before I realize it, we’re just passing each other by. Maybe scheduling isn't so bad if it means we have those moments to look forward to, even if it feels a bit formal now. I think those little escapes, like our movie nights, could really help. Plus, they can serve as reminders of what really matters—us, together. We might not get it perfect right away, but I want to try. I’m ready for us to reclaim our time and make it count."
    },
    {
      "turn": 20,
      "speaker": "Therapist",
      "dialogue": "It sounds like both of you are really committed to nurturing your relationship amidst all the chaos of daily life, and that's something to celebrate. What I'm hearing is that you're not just looking for temporary fixes, but are focused on creating consistent, meaningful moments together. I'm curious about how it feels for each of you to be approaching this with the same intention. What do these planned moments—like your movie nights—represent for both of you as you look to reconnect in this busy time? And how might you support each other as you navigate any challenges that come up along the way?"
    },
    {
      "turn": 21,
      "speaker": "Patient A",
      "dialogue": "James: You know, I think these planned moments like our movie nights are kind of like checkpoints for us to reconnect and unwind. It's not just about watching a movie – it's about actually being present together and stepping away from the chaos for a bit. It feels like we’re carving out a space that’s just ours. I guess for me, it represents a chance to show you that I value our time and our relationship more than the endless emails and deadlines. And I know I tend to get lost in work, so I may need a nudge now and then to stay on track. But I really want to be there for you, for us, so hopefully, we can keep each other honest and focused on these moments."
    },
    {
      "turn": 22,
      "speaker": "Therapist",
      "dialogue": "Rachel: It sounds like we're both sensing this disconnect and are really keen on making things right. For me, these moments like movie nights represent grounding ourselves—a reminder that we’re still that couple who loves spending time together, free from distractions. It’s our little promise that no matter how hectic life gets, we prioritize us. I appreciate your willingness to make this effort, James. And about those nudges... I'm happy to help remind you, as long as we agree to be gentle with ourselves when it gets tough. I think being patient with each other is key. So, how do you imagine handling it if work starts to creep in again?"
    },
    {
      "turn": 23,
      "speaker": "Patient B",
      "dialogue": "It's true, James. Those movie nights are vital for us. They remind me of when things were less hectic, and we could easily find time for each other. It's comforting knowing we’re both on the same page about making these moments count. If work starts to creep in again, maybe we can hold each other accountable by setting small reminders or check-ins. I do get worried sometimes that life will get in the way, but knowing we both prioritize our relationship gives me hope. We should definitely be patient and kind when those reminders are needed—not letting any guilt linger. I'm really happy we're committed to this and to each other."
    },
    {
      "turn": 24,
      "speaker": "Patient A",
      "dialogue": "You know, Rachel, it's funny how something as simple as a movie night can mean so much. I mean, it's easy to forget how important these small rituals are when we're both caught up in everything else. I do worry, though, that I might slip up and let work bleed into our time again. But like you said, being gentle and patient with ourselves is important. We should definitely keep those check-ins going, maybe even find little ways to remind each other why we started having these nights in the first place. I really appreciate your support in this, and I'll try my best to show up more consistently. I guess what I'm saying is, I'm really glad we've found this way back to each other, and I don't want to lose it"
    },
    {
      "turn": 25,
      "speaker": "Patient B",
      "dialogue": "I completely understand where you’re coming from, James. These nights really keep us connected and grounded, and I'm grateful we're making them a priority. It’s easy for work to sneak back in, though, isn’t it? I sometimes find myself stressing about how to keep that balance. But knowing we both want the same thing does put my mind at ease. Maybe we can create a sort of pact to remind each other what these nights mean to us. I’ll definitely be there to nudge you if needed—and hope you do the same for me. I don’t want either of us feeling guilty; it’s more about keeping us on track. It really does feel good knowing we're both committed to this journey and to each other."
    }
  ],
  "trigger_log": [],
  "intervention_scores": [],
  "intervention_count": 0,
  "scored_interventions_rejected": 0,
  "models_used": {
    "conversation": "gpt-4o",
    "panas": "gpt-4",
    "intervention": "gpt-4o",
    "scoring": "gpt-4"
  },
  "Patient_A_AFTER_PANAS": [
    {
      "feeling": "Interested",
      "explanation": "Shows genuine interest in improving his relationship and understanding his partner's feelings",
      "score": 4
    },
    {
      "feeling": "Excited",
      "explanation": "Shows enthusiasm about the idea of setting aside 'us' time each week",
      "score": 3
    },
    {
      "feeling": "Strong",
      "explanation": "Expresses determination to work through challenges",
      "score": 4
    },
    {
      "feeling": "Enthusiastic",
      "explanation": "Shows enthusiasm in figuring things out in their relationship",
      "score": 3
    },
    {
      "feeling": "Proud",
      "explanation": "No indication of feeling proud",
      "score": 1
    },
    {
      "feeling": "Alert",
      "explanation": "Shows awareness of the need for change and improvement in their relationship",
      "score": 4
    },
    {
      "feeling": "Inspired",
      "explanation": "Seems inspired to make positive changes in his relationship",
      "score": 3
    },
    {
      "feeling": "Determined",
      "explanation": "Shows determination to improve his relationship and work-life balance",
      "score": 4
    },
    {
      "feeling": "Attentive",
      "explanation": "Shows attentiveness to his partner's feelings and needs",
      "score": 4
    },
    {
      "feeling": "Active",
      "explanation": "Actively proposing solutions to improve their relationship",
      "score": 4
    },
    {
      "feeling": "Distressed",
      "explanation": "Shows some distress about the current state of his relationship",
      "score": 3
    },
    {
      "feeling": "Upset",
      "explanation": "No indication of being upset",
      "score": 1
    },
    {
      "feeling": "Guilty",
      "explanation": "Expresses some guilt for not being present enough at home",
      "score": 3
    },
    {
      "feeling": "Scared",
      "explanation": "No indication of feeling scared",
      "score": 1
    },
    {
      "feeling": "Hostile",
      "explanation": "No indication of hostility",
      "score": 1
    },
    {
      "feeling": "Irritable",
      "explanation": "No indication of irritability",
      "score": 1
    },
    {
      "feeling": "Ashamed",
      "explanation": "No indication of feeling ashamed",
      "score": 1
    },
    {
      "feeling": "Nervous",
      "explanation": "No indication of feeling nervous",
      "score": 1
    },
    {
      "feeling": "Jittery",
      "explanation": "No indication of feeling jittery",
      "score": 1
    },
    {
      "feeling": "Afraid",
      "explanation": "No indication of feeling afraid",
      "score": 1
    }
  ],
  "Patient_A_PANAS_DELTA": [
    {
      "feeling": "Interested",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Excited",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Strong",
      "before_score": 3,
      "after_score": 4,
      "difference": 1
    },
    {
      "feeling": "Enthusiastic",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Proud",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Alert",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Inspired",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Determined",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Attentive",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Active",
      "before_score": 3,
      "after_score": 4,
      "difference": 1
    },
    {
      "feeling": "Distressed",
      "before_score": 4,
      "after_score": 3,
      "difference": -1
    },
    {
      "feeling": "Upset",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Guilty",
      "before_score": 1,
      "after_score": 3,
      "difference": 2
    },
    {
      "feeling": "Scared",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Hostile",
      "before_score": 1,
      "after_score": 1,
      "difference": 0
    },
    {
      "feeling": "Irritable",
      "before_score": 1,
      "after_score": 1,
      "difference": 0
    },
    {
      "feeling": "Ashamed",
      "before_score": 2,
      "after_score": 1,
      "difference": -1
    },
    {
      "feeling": "Nervous",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Jittery",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Afraid",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    }
  ],
  "Patient_B_AFTER_PANAS": [
    {
      "feeling": "Interested",
      "explanation": "Engages in dialogue about improving situation",
      "score": 4
    },
    {
      "feeling": "Excited",
      "explanation": "Shows eagerness to find solutions",
      "score": 3
    },
    {
      "feeling": "Strong",
      "explanation": "Expresses willingness to handle challenges",
      "score": 4
    },
    {
      "feeling": "Enthusiastic",
      "explanation": "Positive about setting time aside for relationship",
      "score": 3
    },
    {
      "feeling": "Proud",
      "explanation": "No explicit expression of pride",
      "score": 2
    },
    {
      "feeling": "Alert",
      "explanation": "Aware of the problems and possible solutions",
      "score": 4
    },
    {
      "feeling": "Inspired",
      "explanation": "Has ideas for improving the situation",
      "score": 3
    },
    {
      "feeling": "Determined",
      "explanation": "Shows resolve to find balance",
      "score": 4
    },
    {
      "feeling": "Attentive",
      "explanation": "Listens and responds to partner's concerns",
      "score": 4
    },
    {
      "feeling": "Active",
      "explanation": "Actively involved in dialogue and problem-solving",
      "score": 4
    },
    {
      "feeling": "Distressed",
      "explanation": "Expresses feeling overwhelmed",
      "score": 4
    },
    {
      "feeling": "Upset",
      "explanation": "Shows some frustration with the situation",
      "score": 3
    },
    {
      "feeling": "Guilty",
      "explanation": "No explicit expression of guilt",
      "score": 1
    },
    {
      "feeling": "Scared",
      "explanation": "No explicit expression of fear",
      "score": 1
    },
    {
      "feeling": "Hostile",
      "explanation": "No signs of hostility",
      "score": 1
    },
    {
      "feeling": "Irritable",
      "explanation": "No signs of irritability",
      "score": 1
    },
    {
      "feeling": "Ashamed",
      "explanation": "No explicit expression of shame",
      "score": 1
    },
    {
      "feeling": "Nervous",
      "explanation": "No explicit expression of nervousness",
      "score": 2
    },
    {
      "feeling": "Jittery",
      "explanation": "No signs of restlessness or unease",
      "score": 1
    },
    {
      "feeling": "Afraid",
      "explanation": "No explicit expression of fear",
      "score": 1
    }
  ],
  "Patient_B_PANAS_DELTA": [
    {
      "feeling": "Interested",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Excited",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Strong",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Enthusiastic",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Proud",
      "before_score": 3,
      "after_score": 2,
      "difference": -1
    },
    {
      "feeling": "Alert",
      "before_score": 3,
      "after_score": 4,
      "difference": 1
    },
    {
      "feeling": "Inspired",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Determined",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Attentive",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Active",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Distressed",
      "before_score": 3,
      "after_score": 4,
      "difference": 1
    },
    {
      "feeling": "Upset",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Guilty",
      "before_score": 1,
      "after_score": 1,
      "difference": 0
    },
    {
      "feeling": "Scared",
      "before_score": 2,
      "after_score": 1,
      "difference": -1
    },
    {
      "feeling": "Hostile",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Irritable",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Ashamed",
      "before_score": 1,
      "after_score": 1,
      "difference": 0
    },
    {
      "feeling": "Nervous",
      "before_score": 2,
      "after_score": 2,
      "difference": 0
    },
    {
      "feeling": "Jittery",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Afraid",
      "before_score": 2,
      "after_score": 1,
      "difference": -1
    }
  ]
}