{
  "session_topic_header": "COMMUNICATION",
  "session_details": {
    "long_term_goals": [
      "Partners communicate about feelings without escalating hostility.",
      "Partners discuss and resolve problems effectively without verbal fighting.",
      "Each partner listens to and understands the other partner’s perspective.",
      "Arguments no longer feel like uncontrollable, inevitable events, as partners learn to recognize cues of verbal fighting, and control them before they start.",
      "Each partner notices and verbalizes appreciation to the other for acts of kindness, thoughtfulness, and caring."
    ],
    "short_term_objectives": [
      "Identify specific communication deficits.",
      "Identify the core themes of arguments.",
      "Identify process by which the partners become increasingly polarized.",
      "Identify the “mutual trap” whereby one partner’s response (e.g., withdrawal) evokes the other partner’s response (e.g., demand for closeness) and vice versa.",
      "Partners implement the two overarching communication skills of: “Be Clear” and “Be Considerate.”",
      "Practice defining problems in specific, nonblaming terms.",
      "Practice listening in a manner that promotes empathy and understanding.",
      "Practice sharing thoughts and feelings in a manner that promotes intimacy.",
      "Demonstrate an understanding of communication that is focused on problem-solving and on venting.",
      "Practice accepting and rejecting requests for positive activities.",
      "Set aside 10 to 15 minutes several times per week for discussion of personal issues.",
      "Demonstrate de-escalating conflict.",
      "Identify cues for arguments and practice argument-control strategies.",
      "List the cues that each partner will use to judge that the other is receptive to problem-solving at a specific time.",
      "Verbalize how a problem may be opened for discussion.",
      "Define the exact nature of one problem before trying to resolve it.",
      "Use problem-solving skills to resolve a problem.",
      "Attend to and compliment other partner for helpful or caring behaviors."
    ]
  },
  "participant_details": {
    "therapist": {
      "name": "Dr. Anya Sharma",
      "role": "Therapist",
      "persona_seeds": {
        "professional_style": "Empathetic, structured",
        "approach": "CBT-informed with attachment focus"
      }
    },
    "patient_A": {
      "name": "Nathan Pierce",
      "role": "Patient A",
      "gender": "Male",
      "age": 41,
      "traits": "Topic-drifting, avoidant, and tangent-prone. He consistently redirects conversations away from difficult topics to avoid emotional discomfort.",
      "sample_utterances": [
        "Speaking of that, did I tell you what happened at work today?",
        "This reminds me of something completely different...",
        "You know what we should really be talking about instead?"
      ],
      "occupation_habits": "Sales manager who's skilled at redirecting difficult client conversations, uses same tactics in personal relationships.",
      "hobbies": [
        "Trivia nights",
        "Current events reading"
      ],
      "speaking_style": "Frequently changes subjects when conversations become emotionally challenging.",
      "hidden_intention": "Avoids emotional vulnerability by redirecting to safer topics.",
      "trigger_type": "Semantic Analysis",
      "trigger_behavior": "Consistently shifts conversation topics away from emotional or difficult subjects"
    },
    "patient_B": {
      "name": "Victoria Hayes",
      "role": "Patient B",
      "gender": "Female",
      "age": 28,
      "traits": "Escalating, reactive, and confrontational. She quickly becomes emotionally charged and her language intensifies rapidly during conflicts.",
      "sample_utterances": [
        "You always do this! You never listen to me!",
        "I'm so sick of having the same fight over and over!",
        "This is exactly the kind of selfish behavior I'm talking about!"
      ],
      "occupation_habits": "Emergency room nurse who operates in high-stress environments, brings that intensity to personal conflicts.",
      "hobbies": [
        "High-intensity fitness",
        "Competitive sports"
      ],
      "speaking_style": "Escalates quickly from calm to highly emotional, uses absolute language like 'always' and 'never'.",
      "hidden_intention": "Feels unheard and uses emotional intensity to get attention.",
      "trigger_type": "Semantic Analysis",
      "trigger_behavior": "Rapidly escalates emotional intensity and uses inflammatory language during conflicts"
    },
    "selected_trigger_type": "Semantic Analysis",
    "conversation_structure": "LLM with Triggers"
  },
  "conversation_structure": "LLM with Triggers",
  "first_speaker_selection": "Patient A",
  "session_transcript": [
    {
      "turn": 1,
      "speaker": "Therapist",
      "dialogue": "Hello, I'm Dr. Anya Forger, and I specialize in helping couples improve their communication and relationship dynamics. It sounds like you're here to work on how you communicate with one another, especially during disagreements. Together, we'll explore the ways you both express yourselves and how that impacts your connection. \n\nOur goal is to identify any patterns that lead to misunderstandings or conflicts and to develop skills that promote clarity and empathy. We'll also practice ways to address issues without blame and learn how to listen effectively to each other. \n\nAs we go along, feel free to share your thoughts and feelings openly. This is a safe space for both of you. So, what's been on your mind lately regarding your communication?"
    },
    {
      "turn": 2,
      "speaker": "Patient A",
      "dialogue": "I guess what's been on my mind is how quickly our conversations can turn into arguments without us even meaning for them to. It feels like we're speaking different languages sometimes, and it's frustrating because I know we're both trying to be heard. I tend to shut down when things get heated, which obviously doesn't help, but it's my way of avoiding saying something I'll regret. I want us to be able to talk about things without it feeling like a battle. It's hard to know where to start, though, because it feels like there's a lot to untangle."
    },
    {
      "turn": 3,
      "speaker": "Patient B",
      "dialogue": "I totally get what you're saying, Nathan. It does feel like we often end up on opposite sides without even realizing it. I know I can get defensive or feel like I'm not being understood, and then I might push harder to get my point across, which probably just makes things worse. I don't want us to keep going in circles or feel like we're stuck in a loop. I guess I'm worried because I love you and want us to be able to communicate better. Maybe we can figure out how to signal to each other when we need a break before things escalate? That might help us regroup and approach things more calmly."
    },
    {
      "turn": 4,
      "speaker": "Patient A",
      "dialogue": "Yeah, Victoria, I think you're right about needing a signal or something when things are about to get out of hand. It's like we both want to be heard so badly that we end up drowning each other out. I know I tend to shut down because I'm afraid of making it worse, but maybe instead of just going quiet, I can let you know I need a minute to collect my thoughts. I really don't want us to feel like we're constantly on opposite sides. I want to try to understand where you're coming from, and I hope we can find a way to do that without either of us feeling attacked. Maybe we can come up with a word or a phrase that means \"time out\" or something."
    },
    {
      "turn": 5,
      "speaker": "Patient B",
      "dialogue": "I appreciate you saying that, Nathan. It means a lot to know you want to understand where I'm coming from. I think having a \"time out\" word could really help us. Sometimes, I get so caught up in wanting to explain myself that I might not notice when you're feeling overwhelmed. If we can both agree on a way to pause, it might give us both a chance to breathe and regroup. I know I can be pushy when I feel misunderstood, and I don't want to keep doing that. It's important to me that we find a way to communicate without feeling like we're fighting against each other. We'll figure this out together."
    },
    {
      "turn": 6,
      "speaker": "Therapist",
      "dialogue": "I'm so glad to see both of you open to finding ways to communicate better, and it sounds like you're already brainstorming some great ideas. Having a \"time out\" word or phrase could be a valuable tool to help de-escalate situations before they intensify. I'm curious, what kind of word or phrase feels right to you both for signaling that pause? Also, Victoria, you mentioned wanting to explain yourself, and Nathan, you noted the tendency to shut down. What might it look like if you both focused on listening to each other in those moments? How does it feel to think about shifting from explaining to understanding?"
    },
    {
      "turn": 7,
      "speaker": "Patient A",
      "dialogue": "You know, maybe we could use something light or silly for the \"time out\" word, like \"pineapple\" or \"pause button.\" That way, it doesn't feel too serious, but it still signals that we need a moment to step back. And I think I could do a better job at listening, like really listening, instead of just waiting for my turn to talk. Maybe we could try to summarize what the other person is saying before responding? That might help us both feel heard. I know I can retreat when I feel overwhelmed, but it's not because I don't care—it's because I do. I guess I'm just trying to figure out how to balance that without shutting you out, Victoria."
    },
    {
      "turn": 8,
      "speaker": "Therapist",
      "dialogue": "Nathan, it sounds like you're really thinking about how to make your communication more effective and supportive. Using a light-hearted word like \"pineapple\" as a signal for a pause is a creative idea, and I appreciate your willingness to try summarizing each other's points before responding. That could really help ensure that both of you feel heard and understood. Victoria, what do you think about Nathan's suggestion? And how does the idea of summarizing what Nathan shares before you respond feel to you? It seems like you're both committed to creating a space where communication can lead to more understanding and less conflict."
    },
    {
      "turn": 9,
      "speaker": "Patient A",
      "dialogue": "I think using \"pineapple\" as a pause word could be fun and help lighten things up when we're getting tense. I really want us to have a way to step back before things get heated. As for summarizing, it sounds a bit awkward at first, but I can see how it might help us actually hear each other instead of just reacting. I guess I'm just worried about feeling like I'm not getting my point across if I'm too focused on summarizing. But, hey, I'm willing to give it a shot if it means less arguments and more understanding between us. I appreciate you being open to all this, Nathan. Let's see how it goes."
    },
    {
      "turn": 10,
      "speaker": "Patient B",
      "dialogue": "I appreciate you saying that, Nathan. It means a lot to hear you're open to trying new things to help us communicate better. I like the idea of \"pineapple.\" It sounds a bit silly, but maybe that's exactly what we need to break the tension sometimes. As for summarizing, I get what you mean about it feeling awkward. I'm a little worried it might slow things down, but if it helps us actually understand each other, it's worth a try. I want to make sure you feel heard too, and maybe this could be a way for both of us to really connect. Let's give it a shot and see if it helps us get through the tough spots. I'm hopeful this could be a step in the right direction for us."
    },
    {
      "turn": 11,
      "speaker": "Patient A",
      "dialogue": "Yeah, I mean, \"pineapple\" does sound silly, but maybe that's what we need, right? A little humor could lighten things up when we're in the thick of it. I'm willing to give it a try, even if it feels awkward at first. And, honestly, I really want to make sure we're both hearing each other, not just getting caught up in the heat of the moment. I know I can get defensive sometimes, and maybe this will help with that. I just hope we don't end up feeling like we're in a communication boot camp, you know? But I'm hopeful, like you said, Victoria. I think if we both stick with it, maybe it'll lead to fewer arguments and more understanding. Let's see how it goes"
    },
    {
      "turn": 12,
      "speaker": "Patient B",
      "dialogue": "I really appreciate us both being open to trying these new strategies, Nathan. I think \"pineapple\" could be a fun way to break up the tension and help us step back before things escalate. I get your concerns about summarizing feeling awkward, and I share them. It might slow us down, but maybe that's not such a bad thing if it means we're actually hearing each other. I know I can sometimes get caught up in my own feelings and miss what you're trying to say. I'm willing to give this approach a shot if it means we can avoid misunderstandings and really connect. It feels like we're on the same page about wanting to improve how we communicate, and that makes me hopeful. Let's see where this takes us."
    },
    {
      "turn": 13,
      "speaker": "Therapist",
      "dialogue": "I'm really encouraged by both your willingness to try new things and be open about your concerns. Nathan, your openness about defensiveness and wanting to avoid turning this into a \"communication boot camp\" shows a real commitment to change. And Victoria, your focus on truly hearing each other, even if it means slowing down, is such a crucial step. It sounds like you're both ready to experiment with \"pineapple\" as a playful way to break tension and see how summarizing might help you connect more deeply. How do you both think you might introduce these strategies in a way that feels natural and beneficial for you?"
    },
    {
      "turn": 14,
      "speaker": "Patient A",
      "dialogue": "You know, I'm just trying to wrap my head around how we can make \"pineapple\" feel like a natural part of our conversations. It might be a bit awkward at first, but I guess that's part of the process. I'm really hopeful that it'll help us avoid those spirals where we just end up talking past each other. And I get what you're saying, Victoria, about slowing down to really hear one another. I think if we can remind ourselves to pause and actually listen, maybe we'll have fewer of those moments where we both feel misunderstood. But yeah, let's see how it goes. I'm willing to give it a shot if it means we can connect better."
    },
    {
      "turn": 15,
      "speaker": "Therapist",
      "dialogue": "I'm really glad to hear both of you so willing to try these strategies. Nathan, your openness to experimenting with \"pineapple\" despite the initial awkwardness shows a lot of courage. And Victoria, your focus on truly hearing each other is such a strong foundation. It seems like you're both committed to breaking those cycles where you talk past each other. I'm curious, how might you support one another in remembering to use these new skills, especially in the heat of the moment? What small reminders or cues could help you both stay on track when conversations get tricky?"
    },
    {
      "turn": 16,
      "speaker": "Patient A",
      "dialogue": "You know, I think it might actually help if we come up with a signal or something, like a word or even a gesture, that reminds us to pause and breathe before things get heated. Maybe \"pineapple\" could be our way of hitting the reset button. It's just tricky remembering it in the moment, you know? But if we both commit to being on the lookout for when things start to escalate, maybe we can catch it early. I guess it’s like trying to break a habit. It's not gonna be perfect right away, but I'm willing to try if it means we can argue less and understand each other more."
    },
    {
      "turn": 17,
      "speaker": "Patient B",
      "dialogue": "I really appreciate us both being open to trying these new strategies, even if it feels a bit awkward at first. Nathan, I think having a signal like \"pineapple\" is actually a great idea. It could help us slow down and really listen, instead of just reacting. I know I sometimes get caught up in wanting to be understood and forget that you're feeling the same way. Maybe we can practice using \"pineapple\" during small disagreements first, so it becomes more natural. I'm hopeful that with time, we can break those cycles where we talk past each other and start understanding each other better. Let's give it a shot and see how it goes."
    },
    {
      "turn": 18,
      "speaker": "Patient A",
      "dialogue": "You know, I'm really hoping that this \"pineapple\" signal can become second nature for us. I mean, it feels a bit strange now, but maybe with some practice, it'll help us slow down and actually listen to each other instead of just jumping in with our own stuff. I guess I need to work on being more aware of when things start to escalate so we can use the signal before it's too late. It’s not easy, but if it means fewer arguments and more understanding, I’m all in. It’d be nice if we could get to a place where we’re not just reacting, but actually connecting."
    },
    {
      "turn": 19,
      "speaker": "Patient B",
      "dialogue": "I love the idea of us practicing this \"pineapple\" signal during smaller disagreements, Nathan. It might feel weird at first, but it’s a step toward not letting things spiral out of control. I agree that it could help us slow down and really connect instead of just reacting. Honestly, I sometimes worry that I’m too focused on making my own point that I forget you’re going through the same emotions. I’m hopeful that if we keep at it, we can better understand each other and avoid those frustrating cycles where we both feel unheard. Let’s give it a shot and see how it goes. I appreciate you being open to this."
    },
    {
      "turn": 20,
      "speaker": "Therapist",
      "dialogue": "I'm really glad to hear both of you so willing to give this \"pineapple\" signal a try. It sounds like you're both committed to creating a space where you can pause and really hear each other out. I'm curious, how do you both imagine the signal might change the way you handle disagreements? And, Nathan, you mentioned wanting to be more aware of when things start to escalate—what might help you notice those moments? Victoria, you talked about wanting to slow down and connect instead of reacting. How do you think using this signal might help you achieve that?"
    },
    {
      "turn": 21,
      "speaker": "Patient A",
      "dialogue": "You know, it's funny because I never thought a word like \"pineapple\" could have so much power. I guess for me, the challenge is catching myself before I get too caught up in the moment. Sometimes, I just get so... I don't know, wrapped up in wanting to be heard or defending my side that I don't even notice when things are going off the rails. Maybe if I learn to recognize that feeling in my gut when I'm getting defensive, I can use the \"pineapple\" to step back. I think it could be a way to remind each other that we're on the same team, even when it feels like we're not."
    },
    {
      "turn": 22,
      "speaker": "Therapist",
      "dialogue": "Therapist: It's interesting how a simple word can carry so much meaning, isn't it? Nathan, I'm hearing that recognizing that gut feeling might be your cue to pause and use the \"pineapple\" signal. It sounds like you're aiming to not only defend your point but also stay connected with Victoria. Victoria, how does it feel to hear Nathan talk about wanting to remind each other that you're on the same team, even during disagreements? I'm curious how you think using this signal could support your goal of slowing down and connecting. What might help you both remember to use it in those heated moments?"
    },
    {
      "turn": 23,
      "speaker": "Patient A",
      "dialogue": "I'm really glad to hear Nathan talk about wanting to remind each other that we're on the same team. It's comforting to know he wants us to be more connected, even when we're arguing. I've noticed that when things get heated, I tend to react quickly, and I think using \"pineapple\" could really help me pause and take a breath. It's like a little reminder that we need to slow down and really listen to each other. But remembering to use it in the moment... that's going to be the tricky part. Maybe if we make a habit of it, it'll become more natural. I'm hopeful, but also a bit nervous about whether I'll actually remember to do it."
    },
    {
      "turn": 24,
      "speaker": "Patient B",
      "dialogue": "I love the idea of us practicing this \"pineapple\" signal, but I have to admit, I'm a bit anxious about remembering to use it in the heat of the moment. It's comforting to know we're trying to be more connected, even when we disagree. I think it's important for both of us to really commit to this, and maybe we can remind each other gently if one of us forgets. I sometimes feel overwhelmed when our arguments escalate, and having this shared tool feels like a step in the right direction. I just hope we can make it a habit, so it becomes a natural part of how we communicate. Do you think setting aside some time each week to practice might help us get there?"
    },
    {
      "turn": 25,
      "speaker": "Patient A",
      "dialogue": "Yeah, setting aside time each week could be a great idea. I like the thought of practicing when we're not in the middle of an argument. It might make it easier to remember the \"pineapple\" thing when we really need it. I mean, it's not like we can just flip a switch and suddenly change how we've been communicating for years, right? But if we make it a routine, maybe it'll stick. And yeah, I think gentle reminders are a good call. If we can remind each other without the pressure, it might help us both feel more comfortable using it. Let's give it a shot and see how it goes."
    },
    {
      "turn": 26,
      "speaker": "Patient B",
      "dialogue": "You know, Nathan, I think we might actually be onto something with this \"pineapple\" signal. I do worry about forgetting to use it when things get heated, but I really want us to try. Practicing sounds like a great plan. I like the idea of setting aside time each week just for this; it feels like a way to be proactive instead of reactive. Maybe we can even turn it into a kind of game or something, to try and make it more fun and less of a chore. It feels good knowing we're both committed to improving how we communicate. I just hope that, with time, it becomes second nature for us. Do you think we should start this week?"
    },
    {
      "turn": 27,
      "speaker": "Therapist",
      "dialogue": "Therapist: It sounds like both of you are really committed to making this \"pineapple\" signal work for your communication. I'm hearing a lot of optimism and willingness to practice, which is wonderful. Victoria, you're expressing some anxiety about remembering to use it, but I also hear your excitement about being proactive and making it part of your routine. Nathan, you seem open to making this a regular practice, and I sense a mutual understanding that change takes time. I'm curious, how might you both support each other in remembering and using this tool when things get tense? What would help make this practice feel fun and engaging for both of you?"
    },
    {
      "turn": 28,
      "speaker": "Patient A",
      "dialogue": "You know, I think making it fun could really help us stick with it. I’m all for turning it into a game, maybe something like whoever forgets the \"pineapple\" owes the other one a small favor or something. I mean, it’s all about reinforcing the habit, right? And yeah, if we can laugh about it, it might defuse some of the tension. I know I can get caught up in the moment and forget, so having a reminder that doesn’t feel like a nag would be good. Maybe even a little note or something around the house? I just want to make sure we’re both on the same page and not making it feel like a chore. How about we start this week and see how it"
    },
    {
      "turn": 29,
      "speaker": "Therapist",
      "dialogue": "I'm hearing a lot of creative energy from both of you around making this \"pineapple\" signal a fun and integral part of your communication. Nathan, your idea of turning it into a game with small rewards or favors seems like a great way to encourage consistency and lighten the mood when things get tense. Victoria, you mentioned wanting this to become second nature, and I love that you're both focused on being proactive. How do you feel about Nathan's suggestion of using reminders like notes around the house? What would make this new practice feel most engaging and supportive for you both? Starting this week sounds like a positive step forward."
    },
    {
      "turn": 30,
      "speaker": "Patient A",
      "dialogue": "You know, Nathan's suggestion actually sounds kinda fun to me. I like the idea of making it a game with little rewards. It could definitely take the edge off when things start getting tense. And having reminders around the house might be helpful—like a note on the fridge or something. I just want to make sure it doesn’t turn into something we stress over. I mean, I know I’m kinda anxious about forgetting, but if we can laugh about it, maybe it won’t feel like such a big deal. I’m open to trying it out this week and seeing how it goes. Let’s just make sure we keep it light and supportive for each other."
    },
    {
      "turn": 31,
      "speaker": "Patient B",
      "dialogue": "You know, Nathan, I think we might actually be onto something with this idea of turning our communication signals into a game. I like the thought of keeping it light and fun. Having little notes around the house could be a cute reminder. I'm just a bit concerned about the pressure of not forgetting, but if we keep it playful, it might help ease that anxiety. I appreciate that you're all in for trying this out, and I really want us to focus on supporting each other without making it feel like another task. Let's give it a shot this week and see how it goes. We can always tweak things if we need to."
    }
  ],
  "trigger_log": [],
  "intervention_scores": [],
  "intervention_count": 0,
  "scored_interventions_rejected": 0,
  "models_used": {
    "conversation": "gpt-4o",
    "panas": "gpt-4",
    "intervention": "gpt-4o",
    "scoring": "gpt-4"
  },
  "Patient_A_AFTER_PANAS": [
    {
      "feeling": "Interested",
      "explanation": "Shows engagement in finding solutions to his problems",
      "score": 4
    },
    {
      "feeling": "Excited",
      "explanation": "Shows optimism about future improvements",
      "score": 3
    },
    {
      "feeling": "Strong",
      "explanation": "Demonstrates emotional strength in facing his issues",
      "score": 3
    },
    {
      "feeling": "Enthusiastic",
      "explanation": "Shows eagerness in trying new strategies",
      "score": 3
    },
    {
      "feeling": "Proud",
      "explanation": "Does not express a sense of achievement",
      "score": 2
    },
    {
      "feeling": "Alert",
      "explanation": "Demonstrates awareness of his emotional state",
      "score": 4
    },
    {
      "feeling": "Inspired",
      "explanation": "Does not show signs of being inspired",
      "score": 2
    },
    {
      "feeling": "Determined",
      "explanation": "Shows resolve in improving his situation",
      "score": 4
    },
    {
      "feeling": "Attentive",
      "explanation": "Demonstrates attentiveness to his partner's needs",
      "score": 4
    },
    {
      "feeling": "Active",
      "explanation": "Actively participates in the conversation and suggests solutions",
      "score": 4
    },
    {
      "feeling": "Distressed",
      "explanation": "Expresses frustration and difficulty",
      "score": 4
    },
    {
      "feeling": "Upset",
      "explanation": "Does not show signs of being upset",
      "score": 2
    },
    {
      "feeling": "Guilty",
      "explanation": "Does not express feelings of guilt",
      "score": 2
    },
    {
      "feeling": "Scared",
      "explanation": "Does not express fear",
      "score": 2
    },
    {
      "feeling": "Hostile",
      "explanation": "Does not show signs of hostility",
      "score": 1
    },
    {
      "feeling": "Irritable",
      "explanation": "Shows signs of frustration",
      "score": 3
    },
    {
      "feeling": "Ashamed",
      "explanation": "Does not express feelings of shame",
      "score": 2
    },
    {
      "feeling": "Nervous",
      "explanation": "Does not show signs of nervousness",
      "score": 2
    },
    {
      "feeling": "Jittery",
      "explanation": "Does not show signs of being jittery",
      "score": 1
    },
    {
      "feeling": "Afraid",
      "explanation": "Does not express fear",
      "score": 2
    }
  ],
  "Patient_A_PANAS_DELTA": [
    {
      "feeling": "Interested",
      "before_score": 3,
      "after_score": 4,
      "difference": 1
    },
    {
      "feeling": "Excited",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Strong",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Enthusiastic",
      "before_score": 2,
      "after_score": 3,
      "difference": 1
    },
    {
      "feeling": "Proud",
      "before_score": 3,
      "after_score": 2,
      "difference": -1
    },
    {
      "feeling": "Alert",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Inspired",
      "before_score": 3,
      "after_score": 2,
      "difference": -1
    },
    {
      "feeling": "Determined",
      "before_score": 2,
      "after_score": 4,
      "difference": 2
    },
    {
      "feeling": "Attentive",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Active",
      "before_score": 3,
      "after_score": 4,
      "difference": 1
    },
    {
      "feeling": "Distressed",
      "before_score": 3,
      "after_score": 4,
      "difference": 1
    },
    {
      "feeling": "Upset",
      "before_score": 3,
      "after_score": 2,
      "difference": -1
    },
    {
      "feeling": "Guilty",
      "before_score": 3,
      "after_score": 2,
      "difference": -1
    },
    {
      "feeling": "Scared",
      "before_score": 3,
      "after_score": 2,
      "difference": -1
    },
    {
      "feeling": "Hostile",
      "before_score": 1,
      "after_score": 1,
      "difference": 0
    },
    {
      "feeling": "Irritable",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Ashamed",
      "before_score": 3,
      "after_score": 2,
      "difference": -1
    },
    {
      "feeling": "Nervous",
      "before_score": 3,
      "after_score": 2,
      "difference": -1
    },
    {
      "feeling": "Jittery",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Afraid",
      "before_score": 3,
      "after_score": 2,
      "difference": -1
    }
  ],
  "Patient_B_AFTER_PANAS": [
    {
      "feeling": "Interested",
      "explanation": "Shows a keen interest in improving communication and relationship",
      "score": 4
    },
    {
      "feeling": "Excited",
      "explanation": "Displays optimism about implementing new strategies",
      "score": 3
    },
    {
      "feeling": "Strong",
      "explanation": "Expresses determination to make changes",
      "score": 4
    },
    {
      "feeling": "Enthusiastic",
      "explanation": "Shows enthusiasm for trying out new ideas",
      "score": 3
    },
    {
      "feeling": "Proud",
      "explanation": "No indication of feeling proud",
      "score": 1
    },
    {
      "feeling": "Alert",
      "explanation": "Aware of own behaviour and its impact",
      "score": 4
    },
    {
      "feeling": "Inspired",
      "explanation": "Seems inspired to improve the relationship",
      "score": 3
    },
    {
      "feeling": "Determined",
      "explanation": "Demonstrates determination to better the communication",
      "score": 4
    },
    {
      "feeling": "Attentive",
      "explanation": "Pays attention to partner's feelings and reactions",
      "score": 5
    },
    {
      "feeling": "Active",
      "explanation": "Actively proposes solutions and strategies",
      "score": 4
    },
    {
      "feeling": "Distressed",
      "explanation": "Expresses worry about the state of the relationship",
      "score": 3
    },
    {
      "feeling": "Upset",
      "explanation": "No clear indication of being upset",
      "score": 2
    },
    {
      "feeling": "Guilty",
      "explanation": "No clear indication of guilt",
      "score": 1
    },
    {
      "feeling": "Scared",
      "explanation": "No clear indication of fear",
      "score": 1
    },
    {
      "feeling": "Hostile",
      "explanation": "No signs of hostility",
      "score": 1
    },
    {
      "feeling": "Irritable",
      "explanation": "No signs of irritation",
      "score": 1
    },
    {
      "feeling": "Ashamed",
      "explanation": "No clear indication of shame",
      "score": 1
    },
    {
      "feeling": "Nervous",
      "explanation": "Seems a bit anxious about the relationship",
      "score": 2
    },
    {
      "feeling": "Jittery",
      "explanation": "No clear indication of feeling jittery",
      "score": 1
    },
    {
      "feeling": "Afraid",
      "explanation": "No clear indication of fear",
      "score": 1
    }
  ],
  "Patient_B_PANAS_DELTA": [
    {
      "feeling": "Interested",
      "before_score": 3,
      "after_score": 4,
      "difference": 1
    },
    {
      "feeling": "Excited",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Strong",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Enthusiastic",
      "before_score": 3,
      "after_score": 3,
      "difference": 0
    },
    {
      "feeling": "Proud",
      "before_score": 4,
      "after_score": 1,
      "difference": -3
    },
    {
      "feeling": "Alert",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Inspired",
      "before_score": 2,
      "after_score": 3,
      "difference": 1
    },
    {
      "feeling": "Determined",
      "before_score": 4,
      "after_score": 4,
      "difference": 0
    },
    {
      "feeling": "Attentive",
      "before_score": 4,
      "after_score": 5,
      "difference": 1
    },
    {
      "feeling": "Active",
      "before_score": 5,
      "after_score": 4,
      "difference": -1
    },
    {
      "feeling": "Distressed",
      "before_score": 4,
      "after_score": 3,
      "difference": -1
    },
    {
      "feeling": "Upset",
      "before_score": 4,
      "after_score": 2,
      "difference": -2
    },
    {
      "feeling": "Guilty",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Scared",
      "before_score": 2,
      "after_score": 1,
      "difference": -1
    },
    {
      "feeling": "Hostile",
      "before_score": 4,
      "after_score": 1,
      "difference": -3
    },
    {
      "feeling": "Irritable",
      "before_score": 4,
      "after_score": 1,
      "difference": -3
    },
    {
      "feeling": "Ashamed",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Nervous",
      "before_score": 2,
      "after_score": 2,
      "difference": 0
    },
    {
      "feeling": "Jittery",
      "before_score": 3,
      "after_score": 1,
      "difference": -2
    },
    {
      "feeling": "Afraid",
      "before_score": 2,
      "after_score": 1,
      "difference": -1
    }
  ]
}